microbit-foundation/cpp-editor-experiment/src/codal-wasm/pack/libraries/codal-microbit-nrf5sdk/nRF5SDK/components/softdevice/s113/headers/ble.h
/** @brief Encode a @ref ble_uuid_t structure into little endian raw UUID bytes (16-bit or 128-bit).
 *
 * @note The pointer to the destination buffer p_uuid_le may be NULL, in which case only the validity and size of p_uuid is computed.
 *
 * @param[in]   p_uuid        Pointer to a @ref ble_uuid_t structure that will be encoded into bytes.
 * @param[out]  p_uuid_le_len Pointer to a uint8_t that will be filled with the encoded length (2 or 16 bytes).
 * @param[out]  p_uuid_le     Pointer to a buffer where the little endian raw UUID bytes (2 or 16) will be stored.
 *
 * @retval ::NRF_SUCCESS Successfully encoded into the buffer.
 * @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @retval ::NRF_ERROR_INVALID_PARAM Invalid UUID type.
 */
SVCALL(SD_BLE_UUID_ENCODE, uint32_t, sd_ble_uuid_encode(ble_uuid_t const *p_uuid, uint8_t *p_uuid_le_len, uint8_t *p_uuid_le));


/**@brief Get Version Information.
 *
 * @details This call allows the application to get the BLE stack version information.
 *
 * @param[out] p_version Pointer to a ble_version_t structure to be filled in.
 *
 * @retval ::NRF_SUCCESS  Version information stored successfully.
 * @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @retval ::NRF_ERROR_BUSY The BLE stack is busy (typically doing a locally-initiated disconnection procedure).
 */
SVCALL(SD_BLE_VERSION_GET, uint32_t, sd_ble_version_get(ble_version_t *p_version));


/**@brief Provide a user memory block.
 *
 * @note This call can only be used as a response to a @ref BLE_EVT_USER_MEM_REQUEST event issued to the application.
 *
 * @param[in] conn_handle Connection handle.
 * @param[in] p_block Pointer to a user memory block structure or NULL if memory is managed by the application.
 *
 * @mscs
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_PEER_CANCEL_MSC}
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_NOBUF_AUTH_MSC}
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_NOBUF_NOAUTH_MSC}
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_BUF_AUTH_MSC}
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_BUF_NOAUTH_MSC}
 * @mmsc{@ref BLE_GATTS_QUEUED_WRITE_QUEUE_FULL_MSC}
 * @endmscs
 *
 * @retval ::NRF_SUCCESS Successfully queued a response to the peer.
 * @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @retval ::NRF_ERROR_BUSY The stack is busy, process pending events and retry.
 * @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.
 * @retval ::NRF_ERROR_INVALID_LENGTH Invalid user memory block length supplied.
 * @retval ::NRF_ERROR_INVALID_STATE Invalid Connection state or no user memory request pending.
 */
SVCALL(SD_BLE_USER_MEM_REPLY, uint32_t, sd_ble_user_mem_reply(uint16_t conn_handle, ble_user_mem_block_t const *p_block));

/**@brief Set a BLE option.
 *
 * @details This call allows the application to set the value of an option.
 *
 * @param[in] opt_id Option ID, see @ref BLE_COMMON_OPTS and @ref BLE_GAP_OPTS.
 * @param[in] p_opt Pointer to a ble_opt_t structure containing the option value.
 *
 * @retval ::NRF_SUCCESS  Option set successfully.
 * @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.
 * @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied, check parameter limits and constraints.
 * @retval ::NRF_ERROR_INVALID_STATE Unable to set the parameter at this time.
 * @retval ::NRF_ERROR_BUSY The BLE stack is busy or the previous procedure has not completed.
 */
SVCALL(SD_BLE_OPT_SET, uint32_t, sd_ble_opt_set(uint32_t opt_id, ble_opt_t const *p_opt));


/**@brief Get a BLE option.
 *
 * @details This call allows the application to retrieve the value of an option.
 *
 * @param[in] opt_id Option ID, see @ref BLE_COMMON_OPTS and @ref BLE_GAP_OPTS.
 * @param[out] p_opt Pointer to a ble_opt_t structure to be filled in.
 *
 * @retval ::NRF_SUCCESS  Option retrieved successfully.
 * @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.
 * @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied, check parameter limits and constraints.
 * @retval ::NRF_ERROR_INVALID_STATE Unable to retrieve the parameter at this time.
 * @retval ::NRF_ERROR_BUSY The BLE stack is busy or the previous procedure has not completed.
 * @retval ::NRF_ERROR_NOT_SUPPORTED This option is not supported.
 *
 */
SVCALL(SD_BLE_OPT_GET, uint32_t, sd_ble_opt_get(uint32_t opt_id, ble_opt_t *p_opt));

/** @} */
#ifdef __cplusplus
}
#endif
#endif /* BLE_H__ */

/**
  @}
  @}
*/

#ifdef __clang__

#ifndef _CLANG_BLE_H_
#define _CLANG_BLE_H_

#ifdef __cplusplus
extern "C" {
#endif

// prevent from upgrading nRF52 header files more than once
#define NRF_CLANG_SUPPORT 1

// define system call macros only once
#ifndef _SYSCALL_ARGS

#define _SYSCALL_ARGS(_SC_, ...) \
   __asm__ __volatile__ ( \
      "svc %[SC]" \
         : "=r"(r0) : [SC]"I" ((uint16_t)_SC_), ##__VA_ARGS__ : "memory"); \
   return r0; \

#define _SCC(X) ((long) (X))

#define _SYSCALL0(_SC_) \
   register long r0 __asm__("r0"); \
   _SYSCALL_ARGS(_SC_); \

#define _SYSCALL1(_SC_, _a_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   _SYSCALL_ARGS(_SC_, "0"(r0)); \

#define _SYSCALL2(_SC_, _a_, _b_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1)); \

#define _SYSCALL3(_SC_, _a_, _b_, _c_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   register long r2 __asm__("r2") = _SCC(_c_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1), "r"(r2)); \

#define _SYSCALL4(_SC_, _a_, _b_, _c_, _d_) \
   register long r0 __asm__("r0") = _SCC(_a_); \
   register long r1 __asm__("r1") = _SCC(_b_); \
   register long r2 __asm__("r2") = _SCC(_c_); \
   register long r3 __asm__("r3") = _SCC(_d_); \
   _SYSCALL_ARGS(_SC_, "0"(r0), "r"(r1), "r"(r2), "r"(r3)); \

#endif // SYSCALL_CP

static inline uint32_t
sd_ble_enable(uint32_t * p_app_ram_base) {
   _SYSCALL1(SD_BLE_ENABLE, p_app_ram_base);
}

static inline uint32_t
sd_ble_cfg_set(uint32_t cfg_id, ble_cfg_t const * p_cfg, uint32_t app_ram_base) {
   _SYSCALL3(SD_BLE_CFG_SET, cfg_id, p_cfg, app_ram_base);
}

static inline uint32_t
sd_ble_evt_get(uint8_t *p_dest, uint16_t *p_len) {
   _SYSCALL2(SD_BLE_EVT_GET, p_dest, p_len);
}

static inline uint32_t
sd_ble_uuid_vs_add(ble_uuid128_t const *p_vs_uuid, uint8_t *p_uuid_type) {
   _SYSCALL2(SD_BLE_UUID_VS_ADD, p_vs_uuid, p_uuid_type);
}

static inline uint32_t
sd_ble_uuid_vs_remove(uint8_t *p_uuid_type) {
   _SYSCALL1(SD_BLE_UUID_VS_REMOVE, p_uuid_type);
}

static inline uint32_t
sd_ble_uuid_decode(uint8_t uuid_le_len, uint8_t const *p_uuid_le, ble_uuid_t *p_uuid) {
   _SYSCALL3(SD_BLE_UUID_DECODE, uuid_le_len, p_uuid_le, p_uuid);
}

static inline uint32_t
sd_ble_uuid_encode(ble_uuid_t const *p_uuid, uint8_t *p_uuid_le_len, uint8_t *p_uuid_le) {
   _SYSCALL3(SD_BLE_UUID_ENCODE, p_uuid, p_uuid_le_len, p_uuid_le);
}

static inline uint32_t
sd_ble_version_get(ble_version_t *p_version) {
   _SYSCALL1(SD_BLE_VERSION_GET, p_version);
}

static inline uint32_t
sd_ble_user_mem_reply(uint16_t conn_handle, ble_user_mem_block_t const *p_block) {
   _SYSCALL2(SD_BLE_USER_MEM_REPLY, conn_handle, p_block);
}

static inline uint32_t
sd_ble_opt_set(uint32_t opt_id, ble_opt_t const *p_opt) {
   _SYSCALL2(SD_BLE_OPT_SET, opt_id, p_opt);
}

static inline uint32_t
sd_ble_opt_get(uint32_t opt_id, ble_opt_t *p_opt) {
   _SYSCALL2(SD_BLE_OPT_GET, opt_id, p_opt);
}


#ifdef __cplusplus
}
#endif

#endif // _CLANG_BLE_H_

#endif // __clang__

